Repository: tigase/docs-website
Catalog: docs/locales/*/LC_MESSAGES/3.2.0.po
Languages: pl, zh_cn

source: Tigase Advanced Clustering Strategy (ACS)--Version 3.2.0
pl: Zaawansowana Strategia Klastrowania Tigase (ACS)--wersja 3.2.0
zh_cn: Tigase高级集群策略（ACS）--3.2.0版

source: 1. Design and implementation
pl: 1. Projektowanie i wdrażanie
zh_cn: 1.设计和实施

source: ACS is our general purpose, commercial clustering strategy designed for more or less typical XMPP installations easily scaling to millions and beyond of online users without limit on cluster nodes. The load tests we have run over the code were included a user database with 100mln accounts and an average roster size of up to 150, but that\'s not the limit.
pl: ACS jest naszą ogólną, komercyjną strategią klastrowania zaprojektowaną dla mniej lub bardziej typowych instalacji XMPP, łatwo skalującą się do milionów i więcej użytkowników online bez limitu węzłów klastra. Testy obciążeniowe, które przeprowadziliśmy nad kodem obejmowały bazę danych użytkowników z 100 milionami kont i średnim rozmiarem rosteru do 150, ale to nie jest limit.
zh_cn: ACS是我们通用的、商业化的集群策略，主要为典型的XMPP安装而设计，可以轻松地扩展到数百万甚至更多的在线用户，对集群节点没有限制。我们对代码进行的负载测试包括一个有100百万个账户的用户数据库和一个高达150人的平均名册，但这不是极限。

source: 1.2. Design
pl: 1.2. Projektowanie
zh_cn: 1.2.设计

source: The clustering strategy is based on sharing information between cluster nodes about online users. Who is online and where the user is connected. Communication between cluster nodes is processed with the highest priority to ensure minimal delays with online user data population. An efficient synchronization mechanism allows for a minimal traffic between cluster nodes and distributing accurate data about connecting and disconnecting users.
pl: Strategia klastrowania oparta jest na wymianie informacji pomiędzy węzłami klastra o użytkownikach online. Kto jest online i gdzie użytkownik jest podłączony. Komunikacja pomiędzy węzłami klastra jest przetwarzana z najwyższym priorytetem, aby zapewnić minimalne opóźnienia w populacji danych o użytkownikach online. Wydajny mechanizm synchronizacji pozwala na minimalizację ruchu pomiędzy węzłami klastra i dystrybucję dokładnych danych o łączących się i rozłączających użytkownikach.
zh_cn: 集群策略是基于集群节点之间共享有关在线用户的信息。谁是在线的，用户在哪里连接。集群节点之间的通信是以最高优先级处理的，以确保在线用户数据的最小延迟。一个有效的同步机制允许集群节点之间的流量最小，并分发关于连接和断开用户的准确数据。

source: 2. Tigase ACS SM Installation
pl: 2. Instalacja Tigase ACS SM
zh_cn: 2.Tigase ACS SM安装

source: Tigase ACS SM component is by default provided with Tigase XMPP Server release (@-dist-max@ flavour of archive) so it\'s enough to enable it in the configuration. It can be also obtained from tigase-acs distribution package.
pl: Komponent Tigase ACS SM jest domyślnie dostarczany z wersją Tigase XMPP Server (@-dist-max@ smak archiwum), więc wystarczy go włączyć w konfiguracji. Można go również uzyskać z pakietu dystrybucyjnego tigase-acs.
zh_cn: Tigase ACS SM组件默认与Tigase XMPP服务器版本（@-dist-max@风味的存档）一起提供，所以在配置中启用它就可以了。它也可以从tigase-acs发行包中获得。

source: After downloading the archive it\'s simply matter of extracting it and copying contents of jars/ directory of extracted archive to the jars/ directory in tigase-server/ installation directory, eg. under \*nix systems (assuming the archive was downloaded to main Tigase Server directory):
pl: Po pobraniu archiwum wystarczy je rozpakować i skopiować zawartość katalogu jars/ z rozpakowanego archiwum do katalogu jars/ w katalogu instalacyjnym tigase-server/, np. w systemach �nix (zakładając, że archiwum zostało pobrane do głównego katalogu Tigase Server):
zh_cn: 下载存档后，只需将其解压，并将解压后的存档的jars/目录的内容复制到tigase-server/安装目录下的jars/目录，例如，在*nix系统下（假设存档被下载到Tigase服务器主目录）。

source: 3. Tigase ACS SM Configuration
pl: 3. Konfiguracja Tigase ACS SM
zh_cn: 3.Tigase ACS SM配置

source: In order to user Advanced Clustering Strategy, clustering mode first needs to be turned on:
pl: Aby móc korzystać z zaawansowanej strategii klastrowania, należy najpierw włączyć tryb klastrowania:
zh_cn: 为了使用高级集群策略，首先需要打开集群模式。

source: and then an ACS strategy needs to be enabled:
pl: a następnie należy włączyć strategię ACS:
zh_cn: 然后需要启用一个ACS策略。

source: 4. Supported components
pl: 4. Obsługiwane elementy
zh_cn: 4.支持的组件

source: 4.1. Tigase Advanced Clustering Strategy for Multi User Chat (ACS-MUC)
pl: 4.1. Zaawansowana strategia klastrowania Tigase dla czatu z wieloma użytkownikami (ACS-MUC)
zh_cn: 4.1.Tigase多用户聊天高级集群策略（ACS-MUC）。

source: 4.1.1. Overview
pl: 4.1.1. Przegląd
zh_cn: 4.1.1.概述

source: ACS for MUC allows seamless clustering of MUC rooms across Tigase XMPP server cluster installation. ACS for MUC is required for clustered MUC deployments. If offers various strategies to handle distribution of traffic and rooms across the cluster, which allows fine-tune configuration of the deployment to individual needs.
pl: ACS dla MUC pozwala na bezproblemowe klastrowanie pomieszczeń MUC w ramach instalacji klastra serwerów Tigase XMPP. ACS dla MUC jest wymagany dla klastrowanych wdrożeń MUC. Oferuje różne strategie obsługi dystrybucji ruchu i pomieszczeń w klastrze, co pozwala na precyzyjne dostosowanie konfiguracji wdrożenia do indywidualnych potrzeb.
zh_cn: ACS for MUC允许MUC机房在Tigase XMPP服务器集群安装中的无缝集群。ACS for MUC是集群式MUC部署的必要条件。它提供了各种策略来处理流量和房间在集群中的分布，从而可以根据个人需求对部署进行微调。

source: 4.1.2. Tigase ACS MUC Configuration
pl: 4.1.2. Konfiguracja Tigase ACS MUC
zh_cn: 4.1.2.Tigase ACS MUC配置

source: In order to use ACS for MUC, main Advance Clustering Strategy is required. Once it\'s enabled, clustered version of MUC component will be selected by default during startup therefore it\'s not required to configure it explicitly (make sure no class is configured).
pl: W celu użycia ACS dla MUC, wymagana jest główna Advance Clustering Strategy. Po jej włączeniu, klastrowana wersja komponentu MUC będzie domyślnie wybierana podczas uruchamiania, dlatego nie jest wymagane jej jawne konfigurowanie (upewnij się, że nie jest skonfigurowana żadna klasa).
zh_cn: 为了对MUC使用ACS，需要主要的高级集群策略。一旦它被启用，MUC组件的集群版本将在启动时被默认选择，因此不需要明确配置它（确保没有配置类）。

source: It\'s also possible to explicitly configure the class with the following configuration:
pl: Możliwe jest również jawne skonfigurowanie klasy za pomocą następującej konfiguracji:
zh_cn: 也可以通过以下配置明确配置类：

source: With the above configuration default MUC clustering strategy will be used. In order to select different strategy you have to configure it\'s class in strategy bean within muc component bean:
pl: Przy powyższej konfiguracji zostanie użyta domyślna strategia klastrowania MUC. W celu wybrania innej strategii należy skonfigurować klasę w Strategy Bean wewnątrz komponentu muc component bean:
zh_cn: 在上述配置下，将使用默认的MUC集群策略。为了选择不同的策略，你必须在MUC组件豆中的策略豆中配置它/她的类。
